balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ192GA106.PIC
        <edc:SFRDef edc:access="-----------nn---" edc:cname="CNEN6" edc:desc="" edc:impl="0x18" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00---" edc:name="CNEN6" edc:nzwidth="0x10" edc:por="-----------00---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="CN83IE" edc:desc="" edc:mask="0x1" edc:name="CN83IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN84IE" edc:desc="" edc:mask="0x1" edc:name="CN84IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0PUE" edc:desc="" edc:mask="0x1" edc:name="CN0PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1PUE" edc:desc="" edc:mask="0x1" edc:name="CN1PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2PUE" edc:desc="" edc:mask="0x1" edc:name="CN2PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3PUE" edc:desc="" edc:mask="0x1" edc:name="CN3PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4PUE" edc:desc="" edc:mask="0x1" edc:name="CN4PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5PUE" edc:desc="" edc:mask="0x1" edc:name="CN5PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6PUE" edc:desc="" edc:mask="0x1" edc:name="CN6PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7PUE" edc:desc="" edc:mask="0x1" edc:name="CN7PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8PUE" edc:desc="" edc:mask="0x1" edc:name="CN8PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN9PUE" edc:desc="" edc:mask="0x1" edc:name="CN9PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN10PUE" edc:desc="" edc:mask="0x1" edc:name="CN10PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN11PUE" edc:desc="" edc:mask="0x1" edc:name="CN11PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12PUE" edc:desc="" edc:mask="0x1" edc:name="CN12PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13PUE" edc:desc="" edc:mask="0x1" edc:name="CN13PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14PUE" edc:desc="" edc:mask="0x1" edc:name="CN14PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15PUE" edc:desc="" edc:mask="0x1" edc:name="CN15PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnn---nnn" edc:cname="CNPU2" edc:desc="" edc:impl="0xffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000---000" edc:name="CNPU2" edc:nzwidth="0x10" edc:por="0000000000---000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16PUE" edc:desc="" edc:mask="0x1" edc:name="CN16PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17PUE" edc:desc="" edc:mask="0x1" edc:name="CN17PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18PUE" edc:desc="" edc:mask="0x1" edc:name="CN18PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="CN22PUE" edc:desc="" edc:mask="0x1" edc:name="CN22PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23PUE" edc:desc="" edc:mask="0x1" edc:name="CN23PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24PUE" edc:desc="" edc:mask="0x1" edc:name="CN24PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN25PUE" edc:desc="" edc:mask="0x1" edc:name="CN25PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN26PUE" edc:desc="" edc:mask="0x1" edc:name="CN26PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN27PUE" edc:desc="" edc:mask="0x1" edc:name="CN27PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN28PUE" edc:desc="" edc:mask="0x1" edc:name="CN28PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN29PUE" edc:desc="" edc:mask="0x1" edc:name="CN29PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30PUE" edc:desc="" edc:mask="0x1" edc:name="CN30PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN31PUE" edc:desc="" edc:mask="0x1" edc:name="CN31PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------------n" edc:cname="CNPU3" edc:desc="" edc:impl="0x0001" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0" edc:name="CNPU3" edc:nzwidth="0x10" edc:por="---------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32PUE" edc:desc="" edc:mask="0x1" edc:name="CN32PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn-nnnnnnnn-" edc:cname="CNPU4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-00000000-" edc:name="CNPU4" edc:nzwidth="0x10" edc:por="000000-00000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN49PUE" edc:desc="" edc:mask="0x1" edc:name="CN49PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50PUE" edc:desc="" edc:mask="0x1" edc:name="CN50PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51PUE" edc:desc="" edc:mask="0x1" edc:name="CN51PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52PUE" edc:desc="" edc:mask="0x1" edc:name="CN52PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53PUE" edc:desc="" edc:mask="0x1" edc:name="CN53PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54PUE" edc:desc="" edc:mask="0x1" edc:name="CN54PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55PUE" edc:desc="" edc:mask="0x1" edc:name="CN55PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56PUE" edc:desc="" edc:mask="0x1" edc:name="CN56PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN58PUE" edc:desc="" edc:mask="0x1" edc:name="CN58PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59PUE" edc:desc="" edc:mask="0x1" edc:name="CN59PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60PUE" edc:desc="" edc:mask="0x1" edc:name="CN60PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61PUE" edc:desc="" edc:mask="0x1" edc:name="CN61PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62PUE" edc:desc="" edc:mask="0x1" edc:name="CN62PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63PUE" edc:desc="" edc:mask="0x1" edc:name="CN63PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnn--nn" edc:cname="CNPU5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------00000--00" edc:name="CNPU5" edc:nzwidth="0x10" edc:por="------00000--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64PUE" edc:desc="" edc:mask="0x1" edc:name="CN64PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65PUE" edc:desc="" edc:mask="0x1" edc:name="CN65PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CN68PUE" edc:desc="" edc:mask="0x1" edc:name="CN68PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69PUE" edc:desc="" edc:mask="0x1" edc:name="CN69PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70PUE" edc:desc="" edc:mask="0x1" edc:name="CN70PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71PUE" edc:desc="" edc:mask="0x1" edc:name="CN71PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN72PUE" edc:desc="" edc:mask="0x1" edc:name="CN72PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
